app/controllers/movies_controller.rb

  def similar
    @movie = Movie.find(params[:movie_id])
    @similar_movies = Movie.where('id != ? AND director = ?', params[:movie_id], @movie.director)
    if @similar_movies.empty?
---
SELECT "movies".* FROM "movies" WHERE (id != '1' AND director = 'George Lucas')
SELECT COUNT(*) FROM "movies" WHERE (id != '1' AND director = 'George Lucas')

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "title" = ?, "rating" = ?, "release_date" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Movie1"], ["rating", "G"], ["release_date", "2003-10-10 00:00:00.000000"], ["director", "Director1"], ["updated_at", "2018-10-03 03:46:17.237801"], ["id", 1]]